tsung_scripts/buyer_workflow.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
    
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="3000"></option>
  </options>

  <sessions>
    <session name="buyer_login" type="ts_http" weight="1">

      <transaction name="login">
        
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/buyers/sign_in"></http>
        </request>
        <!--thinktime value="1" random="true"></thinktime-->
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

        <request subst="true">
          <http url="/buyers/sign_in" version="1.1" method="POST"
            contents="buyer[email]=buyer1@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
                      buyer[password]=password&amp;commit=Log+in"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>
        <request subst ="true">
        	<http url="/items/5" version="1.1" method="POST"
        		contents="authenticity_token=%%_authenticity_token%%"
        		content_type="application/x-www-form-urlencoded">
               </http>
        </request>
        <thinktime value="10" random="true"></thinktime>

        <request subst="true">
          <http url="/cart/1" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <!--request subst="true">
          <http url="/cart/299" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request-->

        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/showcart"></http>
        </request>
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

        <request subst="true">
          <http url="/orderplaced" version="1.1" method="POST"
            contents="authenticity_token=%%_authenticity_token%%&amp;
            helo=%%_authenticity_token%%&amp;requestparam=%7B%22body%22%3A%5B%7B%22item_id%22%3A%22300%22%2C%22quantity%22%3A%221%22%7D%5D%7D"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <!--request>
          <dyn_variable name="mytoken" 
              re="&lt;meta name=&quot;csrf-token&quot; content=&quot;(.*)&quot; /&gt;" 
              decode="html_entities"/>
          <http method="GET" url="/"></http>
        </request-->
        <!--request>
          <dyn_variable name="authenticity_token" decode="html_entities"></dyn_variable>
          <http method="GET" url="/"></http>
        </request>
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>
        <request>
          <http url="/buyers/sign_out" version="1.1" method="DELETE"
            contents="authenticity_token=%%_authenticity_token%%&amp;
            hello=%%_authenticity_token%%">
          </http>
        </request-->
        
      </transaction>

    </session>
  </sessions>
</tsung>