tsung_scripts/tsung_buyer_rates.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="15000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="sharath.eba-fbpd2mid.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="3000"></option>
  </options>

  <sessions>
    <session name="buyer_rates" type="ts_http" weight="1">

      <transaction name="login">
        
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http method="GET" url="/buyers/sign_in"></http>
        </request>
        
        <thinktime value='1' random='true'/>
        
        <setdynvars code='fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,"[+]","%2B",[global,{return,list}]) end.' sourcetype="eval"> <var name="authenticity_token" /> </setdynvars>

        <request subst="true">
          <http url="/buyers/sign_in" version="1.1" method="POST"
            contents="buyer[email]=buyer1@example.com&amp;authenticity_token=%%_authenticity_token%%&amp;
                      buyer[password]=password&amp;commit=Log+in"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request subst="true">
          <http url="/orders" version="1.1" method="GET"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <thinktime value='1' random='true'/>

        <request subst="true">
          <http url="/orders" version="1.1" method="GET"
            contents="authenticity_token=%%_authenticity_token%%"
            content_type="application/x-www-form-urlencoded">
          </http>
        </request>

      </transaction>

    </session>
  </sessions>
</tsung>